RhinoInside.Revit API Documentation
GeometryDecoder.ToCurve Method (CylindricalHelix)
 Converts the specified Autodesk.Revit.DB.CylindricalHelix to an equivalent Rhino.Geometry.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.Curve ToCurve(
	this Autodesk.Revit.DB.CylindricalHelix helix
)
@staticmethod
def ToCurve(
	helix: Autodesk.Revit.DB.CylindricalHelix
) -> Rhino.Geometry.Curve
Parameters
helix
Type: Autodesk.Revit.DB.CylindricalHelix
Revit helix to convert.
Return Value
Type: Rhino.Geometry.Curve
Rhino curve that is equivalent to the provided Revit helix.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.CylindricalHelix. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(CylindricalHelix) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Curve rhinoCurve = revitHelix.ToCurve();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_curve = revit_helix.ToCurve() # type: RG.Curve
 Using ToCurve(CylindricalHelix) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Curve rhinoCurve = GeometryEncoder.ToCurve(revitHelix)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_curve = GD.ToCurve(revit_helix) # type: RG.Curve
See Also
Reference
GeometryDecoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace